# MAT281 - Laboratorio N°03

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información de distintos usuarios (edad ,sexo, profesión, etc.).

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [103]:
import pandas as pd
import os

In [104]:
# cargar datos
df = pd.read_csv(os.path.join("ocupation.csv"), sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1.- ¿Cuál es el número de observaciones en el conjunto de datos?

In [105]:
#El conjunto de datos tiene 943 observaciones

obs=df.shape[0]
print(obs)

943

2.- ¿Cuál es el número de columnas en el conjunto de datos?

In [106]:
#El conjunto tiene un total de 5 columnas

columnas=df.shape[1]
print(columnas)

5

3.- Imprime el nombre de todas las columnas

In [107]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

4.- Imprima el índice del dataframe

In [108]:
df.index

RangeIndex(start=0, stop=943, step=1)

5.- ¿Cuál es el tipo de datos de cada columna?

In [109]:
#Se tienen dos atributos numéricos (enteros) y 3 atributos de clasificación.
#Notar que el zipcode es un número pero no está en formato entero

df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6.- Describir el conjunto de datos (**hint**: .describe())

In [110]:
#Se muestra un resumen de los datos

df.describe(include='all')

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

7.- Imprimir solo la columna de **occupation**.

In [111]:
df['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

8.- ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [112]:
#Existen 21 ocupaciones distintas en el conjunto de datos 

df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [113]:
len(df['occupation'].unique())

21

9.- ¿Cuál es la ocupación más frecuente?

In [114]:
#La ocupación más frecuente es 'student'

df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

10.- ¿Cuál es la edad media de los usuarios?

In [115]:
#La edad media de los usuarios es aproximadamente igual a 34 años

df['age'].mean()

34.05196182396607

11.- ¿Cuál es la edad con menos ocurrencia?

In [117]:
df['age'].value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
11     1
10     1
73     1
66     1
7      1
Name: age, Length: 61, dtype: int64

In [116]:
#Las edades con menos ocurrencia son 7, 66, 73, 10 y 11 años

df['age'].value_counts().tail(10)

58    3
64    2
68    2
69    2
62    2
11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

12.- Encontrar la edad promedio según la variable **occupation**

In [120]:
df.groupby('occupation', as_index=False).age.mean()

       occupation        age
0   administrator  38.746835
1          artist  31.392857
2          doctor  43.571429
3        educator  42.010526
4        engineer  36.388060
5   entertainment  29.222222
6       executive  38.718750
7      healthcare  41.562500
8       homemaker  32.571429
9          lawyer  36.750000
10      librarian  40.000000
11      marketing  37.615385
12           none  26.555556
13          other  34.523810
14     programmer  33.121212
15        retired  63.071429
16       salesman  35.666667
17      scientist  35.548387
18        student  22.081633
19     technician  33.148148
20         writer  36.311111

## Problema 02


<img src="https://image.freepik.com/vector-gratis/varios-automoviles-dibujos-animados_23-2147613095.jpg" width="360" height="360" align="center"/>


EL conjunto de datos se denomina `Automobile_data.csv`, el cual contiene información tal como: compañia, precio, kilometraje, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [124]:
# cargar datos
df = pd.read_csv(os.path.join("Automobile_data.csv")).set_index('index')
df.head()

           company   body-style  ...  average-mileage    price
index                            ...
0      alfa-romero  convertible  ...               21  13495.0
1      alfa-romero  convertible  ...               21  16500.0
2      alfa-romero    hatchback  ...               19  16500.0
3             audi        sedan  ...               24  13950.0
4             audi        sedan  ...               18  17450.0

[5 rows x 9 columns]

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. Elimine los valores nulos (Nan)

In [125]:
df.dropna

<bound method DataFrame.dropna of            company   body-style  ...  average-mileage    price
index                            ...
0      alfa-romero  convertible  ...               21  13495.0
1      alfa-romero  convertible  ...               21  16500.0
2      alfa-romero    hatchback  ...               19  16500.0
3             audi        sedan  ...               24  13950.0
4             audi        sedan  ...               18  17450.0
...            ...          ...  ...              ...      ...
81      volkswagen        sedan  ...               27   7975.0
82      volkswagen        sedan  ...               37   7995.0
86      volkswagen        sedan  ...               26   9995.0
87           volvo        sedan  ...               23  12940.0
88           volvo        wagon  ...               23  13415.0

[61 rows x 9 columns]>

In [126]:
df.isnull().sum()

company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

2. Encuentra el nombre de la compañía de automóviles más cara

In [127]:
#La compañía de automóviles más cara es porsche,
#ya que su promedio de precios es el mayor

df.groupby('company', as_index=False).price.mean()

          company         price
0     alfa-romero  15498.333333
1            audi  16392.500000
2             bmw  27213.333333
3       chevrolet   6007.000000
4           dodge   6303.000000
5           honda  10195.000000
6           isuzu   6785.000000
7          jaguar  34600.000000
8           mazda   9654.800000
9   mercedes-benz  35040.000000
10     mitsubishi   6689.000000
11         nissan   8289.000000
12        porsche  35528.000000
13         toyota   8216.857143
14     volkswagen   8435.000000
15          volvo  13177.500000

3. Imprimir todos los detalles de Toyota Cars

4. Cuente el total de automóviles por compañía

In [128]:
df['company'].value_counts()

toyota           7
bmw              6
nissan           5
mazda            5
mitsubishi       4
volkswagen       4
mercedes-benz    4
audi             4
honda            3
jaguar           3
chevrolet        3
isuzu            3
porsche          3
alfa-romero      3
dodge            2
volvo            2
Name: company, dtype: int64

5. Encuentra el coche con el precio más alto por compañía

In [143]:
#El coche con el precio más alto es mercedes-benz

df.groupby('company', as_index=False).price.max()

          company    price
0     alfa-romero  16500.0
1            audi  18920.0
2             bmw  41315.0
3       chevrolet   6575.0
4           dodge   6377.0
5           honda  12945.0
6           isuzu   6785.0
7          jaguar  36000.0
8           mazda  18344.0
9   mercedes-benz  45400.0
10     mitsubishi   8189.0
11         nissan  13499.0
12        porsche  37028.0
13         toyota  15750.0
14     volkswagen   9995.0
15          volvo  13415.0

6. Encuentre el kilometraje promedio (**average-mileage**) de cada compañía automotriz

In [135]:
df.groupby('company', as_index=False).average-mileage.mean()

AttributeError: ignored

7. Ordenar todos los autos por columna de precio (**price**)

## Problema 03


Siguiendo la temática de los automóviles, resuelva los siguientes problemas:

### a) Subproblema 01
A partir de los siguientes diccionarios:

In [137]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
* Concatene ambos dataframes (**carsDf**) y añada una llave ["Germany", "Japan"], según corresponda.

### b) Subproblema 02

A partir de los siguientes diccionarios:

In [140]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
*  Junte ambos dataframes (**carsDf**) por la llave **Company**.

In [142]:
carsDf1 = pd.DataFrame(Car_Price)
carsDf2 = pd.DataFrame(car_Horsepower)
carsDf = pd.merge(carsDf1,carsDf2, on='Company')

carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160